import React from 'react';
import './AboutCard.css';
import { Link } from 'react-router-dom';
import { Button } from './Button';

function AboutCard(props) {
  
  return (
    <>
        <h1 className="text">Про нас</h1>
        <Link className='cards__item__link' to='/About'>
            <div className="about_container">
            {/* <figure className='about__item__pic-wrap' data-category={props.label}>
                <img
                className='about__item__img'
                alt='Travel Image'
                src={props.src}
                />
            </figure> */}
            <div className='cards__item__info'>
                <h5 className='cards__item__text'>Ласкаво просимо до благодійної організації "Зіронька" – світло надії та волонтерської допомоги в Україні!

"Зіронька" – це неприбуткова організація, заснована з метою підтримки тих, хто потребує допомоги та збуджує доброту у серцях людей. Наша команда волонтерів присвячена принципу ділитися своїми талантами, часом та ресурсами для покращення якості життя українських громад.

У "Зіроньці" ми віримо в силу спільної дії та прагнемо створити позитивну зміну в різних сферах життя. Ми допомагаємо дітям, сиротам, молоді, літнім людям та всім, хто потребує підтримки. Наші проекти охоплюють широкий спектр ініціатив, включаючи освіту, медицину, соціальну підтримку, екологію та культурні заходи.

Наша команда волонтерів – це група небайдужих людей, що об'єднана спільною метою допомагати і змінювати світ навколо нас. Ми прагнемо надати кожному можливість бути частиною позитивної зміни і виявити свій внесок у будівництво кращого майбутнього.

Наша організація зосереджена на ефективному використанні ресурсів та розвитку інноваційних проектів. Ми відкриті до співпраці з партнерами, донорами та громадськими організаціями, щоб разом досягти більшої сили та впливу. "Зіронька" запрошує вас стати частиною нашої родини волонтерів. Разом ми можемо зробити багато добрих справ та принести радість тим, хто її найбільше потребує. Долучайтеся до наших проектів, поділіться своїми ідеями та надайте допомогу, щоб разом ми створювали світлу майбутнє для всіх.</h5>
                    <Button
                    path='/about'
                    className='det'
                    buttonSize='btn--large'
                    >
                    ДЕТАЛЬНІШЕ
                    </Button>
            </div>
            {/* <p className="">
            </p> */}
 
               
            </div>
        </Link>
        
    </>
  );
}

export default AboutCard;